Repository: bigbr1212/xpd-ebike
Catalog: po/*.po
Languages: de, ru

source: Copyright (C) 2011 Andrey Zabolotnyi
ru: Авторское право (C) 2011 Андрей Заболотный

source: A tool for setting up "Infineon" e-bike controllers
de: Ein Werkzeug zum Einstellen von "Infineon" E-Bike Controllern.
ru: Утилита настройки контроллеров "Инфинеон" для элвелов

source: This program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program. If not, see <http://www.gnu.org/licenses/>.
de: Dieses Programm ist freie Software. Sie können es unter den Bedingungen der GNU General Public License, wie von der Free Software Foundation veröffentlicht, weitergeben und/oder modifizieren, entweder gemäß Version 2 der Lizenz oder (nach Ihrer Option) jeder späteren Version. Die Veröffentlichung dieses Programms erfolgt in der Hoffnung, daß es Ihnen von Nutzen sein wird, aber OHNE IRGENDEINE GARANTIE, sogar ohne die implizite Garantie der MARKTREIFE oder der VERWENDBARKEIT FÜR EINEN BESTIMMTEN ZWECK. Details finden Sie in der GNU General Public License. Sie sollten ein Exemplar der GNU General Public License zusammen mit diesem Programm erhalten haben. Falls nicht, schreiben Sie an die Free Software Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110, USA.
ru: Это программа является свободным программным обеспечением. Вы можете распространять и/или модифицировать её согласно условиям Стандартной Общественной Лицензии GNU, опубликованной Фондом Свободного Программного Обеспечения, версии 3 или, по Вашему желанию, любой более поздней версии. Эта программа распространяется в надежде, что она будет полезной, но БЕЗ ВСЯКИХ ГАРАНТИЙ, в том числе подразумеваемых гарантий ТОВАРНОГО СОСТОЯНИЯ ПРИ ПРОДАЖЕ и ГОДНОСТИ ДЛЯ ОПРЕДЕЛЁННОГО ПРИМЕНЕНИЯ. Смотрите Стандартную Общественную Лицензию GNU для получения дополнительной информации. Вы должны были получить копию Стандартной Общественной Лицензии GNU вместе с программой. В случае её отсутствия, посмотрите <http://www.gnu.org/licenses/>.

source: Edit controller profile
de: Controller-Profil editieren
ru: Изменение конфигурации

source: Profile name:
de: Profilname:
ru: Название конфигурации:

source: Controller family:
de: Controller-Familie:
ru: Семейство контроллера:

source: eXtended Parameter Designer
ru: Расширенный редактор параметров

source: Serial port
de: Serieller Port
ru: Программатор

source: Extra data at the end of file: '%(data)s'
de: Zusätzliche Daten am Ende der Datei: '%(data)s'
ru: Лишние данные в конце файла: '%(data)s'

source: Auto
de: Automatisch
ru: Авто

source: Switch
de: Schalter
ru: Селектор

source: Cycle 3
de: Sequenziell 3
ru: Цикл 3

source: High Switch
de: Schalter HIGH
ru: Селектор +

source: Cycle 4
de: Sequenziell 4
ru: Цикл 4

source: Common VCC
de: Gemeinsames VCC
ru: Общая VCC

source: Common GND
de: Gemeinsame Masse
ru: Общая GND

source: Enable
de: Aktivieren
ru: Включено

source: Disable
de: Deaktivieren
ru: Выключено

source: Disabled
de: Deaktiviert
ru: Отключено

source: Moderate
de: Moderat
ru: Средний

source: Strong
de: Stark
ru: Высокий

source: Unlimited
de: Unbegrenzt
ru: Неограниченный

source: Low
ru: Низкий

source: High
ru: Высокий

source: Enabled
de: Aktiviert
ru: Включено

source: Fast
de: Schnell
ru: Быстрый

source: Slow
de: Langsam
ru: Медленный

source: No
de: Nein
ru: Нет

source: Yes
de: Ja
ru: Да

source: Speed 1
de: Geschwindigkeitsstufe 1
ru: Скорость 1

source: Speed 2
de: Geschwindigkeitsstufe 2
ru: Скорость 2

source: Speed 3
de: Geschwindigkeitsstufe 3
ru: Скорость 3

source: Speed 4
de: Geschwindigkeitsstufe 4
ru: Скорость 4

source: Controller type
de: Controllertyp
ru: Тип контроллера

source: The type of your controller. This influences the coefficients assumed for various parts of the controller, e.g. shunts, resistive dividers. If you have a non-standard controller, you may create your own type in infineon.py
de: Ihr Controllertyp. Diese Einstellung beeinflusst die verwendeten Koeffizienten für verschiedene Teile des Controllers, z.B. Shunt-Widerstände oder Spannungsteiler. Falls Sie über einen nicht standardmäßigen Controller verfügen, können Sie einen eigenen Typ in der Datei "infineon.py" anlegen.
ru: Тип Вашего контроллера. От него зависят коэффициенты, принимаемые для некоторых частей схемы, например шунтов и резисторных делителей. Если Ваш контроллер нестандартный, Вы можете добавить свой тип в infineon.py

source: Phase current limit
de: Max. Phasenstrom
ru: Ограничение фазного тока

source: The current limit in motor phase wires. Since the e-bike controller is, in a sense, a step-down DC-DC converter, the motor current can actually be much higher than the battery current. When setting this parameter, make sure you don't exceed the capabilities of the MOSFETs in your controller. This parameter mostly affects the acceleration on low speeds.
de: Der maximale Strom in den Motorphasen. Da der Controller gewissermaßen ein Step-Down-Wandler ist, kann der Motorstrom wesentlich höher sein als der Strom von Akku. Achten Sie bitte beim Konfigurieren dieser Einstellung darauf, die MOSFETs in Ihrem Controller nicht zu überlasten. Diese Einstellung beeinflusst am meisten die Beschleunigung bei niedrigen Geschwindigkeiten.
ru: Ограничение тока в фазных проводах двигателя. Так как контроллер, в определённом смысле, является импульсным понижателем напряжения, ток двигателя может многократно превышать ток, вытекающий из батареи. Удостоверьтесь, что данный параметр не превышает максимально допустимого значения для выходных КМОП ключей. Этот параметр влияет, в основном, на ускорение при низких скоростях.

source: A
ru: А

source: Battery current limit
de: Max. Strom vom Akku
ru: Ограничение тока батареи

source: The limit for the current drawn out of the battery. Make sure this does not exceed the specs for your battery, otherwise you will lose a lot of energy heating up the battery (and may blow it, too).
de: Der maximale Strom, der dem Akku entnommen wird. Stellen Sie sicher, dass der maximale Entladestrom der Batterie hierbei nicht überschritten wird, da ansonsten Energie durch Aufheizen des Akkus verloren geht, bzw. sogar ein Defekt droht.
ru: Ограничение для тока, вытекающего из батареи. Удостоверьтесь, что данный параметр не превышает максимально допустимых токов для Вашей батареи, иначе Вы потеряете много энергии на разогрев батареи, можете её повредить и даже спровоцировать взрыв (для некоторых типов аккумуляторов).

source: Battery low voltage
de: Entladeschlussspannung Akku
ru: Минимальное напряжение батареи

source: The voltage at which controller cuts of the power. Make sure this is at least equal to lowest_cell_voltage x cell_count (e.g. for a 12S LiFePO4 battery this would be 2.6 * 12 = 31.2V). This does not matter much if you use a BMS, since it will cut the power as soon as *any* cell reaches the lowest voltage, which is much better for the health of your battery.
de: Die Spannung, unterhalb derer der Controller abschaltet. Stellen Sie sicher dass dieser Wert mindestens gleich dem Wert "geringste Zellspannung" x "Anzahl der Zellen" ist (z.B. bei einem 12S LiFePO4 Akku: 2,6 * 12 = 31,2V). Diese Einstellung ist quasi überflüssig, wenn Sie ein BMS verwenden, da hierbei die Abschaltung bereits erfolgt wenn auch nur eine der Zellen die geringste zulässige Spannung erreicht, was wiederum sehr viel besser für die Langlebigkeit des Akkus ist.
ru: Напряжение, при котором контроллер отключает нагрузку. Удостоверьтесь, что данный параметр хотя бы равен минимальному напряжению ячейки (для используемого типа аккумуляторов) помноженному на количество ячеек; например, для LiFePO4 батареи 12S это напряжение будет равно 2.6 * 12 = 31.2V. Этот параметр не так важен в случае использования BMS: последняя сама отключит нагрузку как только напряжение на *любой* из ячеек достигнет минимально допустимого.

source: V
ru: В

source: Battery low voltage threshold
de: Unterspannungsschwelle
ru: Порог минимального напряжения

source: The amount of volts for the battery voltage to rise after a cutoff due to low voltage for the controller to restore power back. This is most useful for plumbum batteries, as they tend to restore voltage after a bit of rest.
de: Die Spannungsdifferenz, um die die Akkuspannung nach einer Abschaltung aufgrund zu geringer Akkuspannung steigen muss, damit der Controller den Betrieb wieder aufnimmt. Diese Einstellung eignet sich am besten für Bleiakkus, da dieser Akkutyp dazu neigt, nach einer gewissen Ruhepause sein Spannungsniveau wieder anzuheben.
ru: Изменение напряжения в сторону увеличения после отключения, которое заставит контроллер вновь включить нагрузку. Этот параметр наиболее полезен при использовании батарей с большим внутренним сопротивлением и свинцовых аккумуляторов (последние имеют свойство слегка восстанавливаться после "отдыха").

source: Speed switch mode
de: Modus Geschwindigkeitsschalter
ru: Режим переключателя скорости

source: The way how the speed switch functions. When in 'Switch' mode you may use a three-position switch which connects X1 (speed 1) or X2 (speed 3) to GND, or leaves both unconnected (speed 2). In 'Cycle 3' mode connecting X1 to ground with a momentary switch will cycle speeds 1-2-3. The 'High Switch' mode is similar to 'Switch', but X1/X2 should connect to high voltage (+5V or +BAT). The 'Cycle 4' mode is like 'Cycle 3', but cycles between speeds 1-2-3-4.
de: Die Art auf welche der Geschwindigkeitsschalter funktioniert. Im Modus "Schalter" können Sie einen drei-Wege-Schalter verwenden, der X1 (Geschwindigkeit 1) oder X2 (Geschwindigkeit 3) mit Masse (GND) verbindet, oder auch beide unverbunden lässt (Geschwindigkeit 2). Im Modus "Sequenziell 3" können Sie mittels eines Tasters, der X1 mit Masse (GND) verbindet, nach der Reihe die Geschwindigkeiten von 1 bis 3 durchschalten. Der Modus "Schalter HIGH" ist dem Modus "Schalter" entsprechend, X1 und X2 müssen hierbei jedoch mit Spannung verbunden werden (+5V oder +BAT). Der Modus "Sequenziell 4" entspricht dem Modus "Sequenziell 3", schaltet jedoch zwischen den Geschwindigkeiten von 1 bis 4.
ru: Режим работы переключателя скоростей. В режиме 'Селектор' Вы можете подключить трёхпозиционный переключатель, который соединяет точки платы X1 (скорость 1) и X2 (скорость 3) к GND для выбора одной из трёх скоростей (в случае, если оба контакта не подключены, выбирается скорость 2). В режиме 'Цикл 3' кратовременным подключением X1 на GND будете переключаться между скоростями 1, 2 и 3. Режим 'Селектор +' подобен режиму 'Селектор', но выбор осуществляя подключением точек X1/X2 к высокому напряжению (+5В либо +БАТ). Режим 'Цикл 4' подобен режиму 'Цикл 3', но переключается между четырьмя скоростями.

source: The first speed limit (see comment to 'speed switch mode').
de: Das erste Geschwindigkeitslimit. (Siehe auch den Kommentar zu "Geschwindigkeitsschalter")
ru: Первое ограничение скорости (см. комментарий к 'режиму переключателя').

source: The second speed limit (see comment to 'speed switch mode').
de: Das zweite Geschwindigkeitslimit. (Siehe auch den Kommentar zu "Geschwindigkeitsschalter")
ru: Второе ограничение скорости (см. комментарий к 'режиму переключателя').

source: The third speed limit (see comment to 'speed switch mode').
de: Das dritte Geschwindigkeitslimit. (Siehe auch den Kommentar zu "Geschwindigkeitsschalter")
ru: Третье ограничение скорости (см. комментарий к 'режиму переключателя').

source: The fourth speed limit (see comment to 'speed switch mode').
de: Das vierte Geschwindigkeitslimit. (Siehe auch den Kommentar zu "Geschwindigkeitsschalter")
ru: Первое ограничение скорости (см. комментарий к 'режиму переключателя').

source: Limited speed
de: Max. Geschwindigkeit
ru: Ограниченная скорость

source: The speed corresponding to 100% throttle when the 'speed limit' switch/wires are enabled (when the 'SL' board contact is connected to ground).
de: Die Geschwindigkeit welche Vollgas entspricht, wenn der "SL" Kontakt auf dem Board mit Masse (GND) verbunden ist (z.B. "speed limit" Schalter).
ru: Скорость при полном повороте ручки газа в режиме 'ограничения скорости' (при соединении точки SL на плате к земле), в процентах от максимальной.

source: Reverse speed
de: Geschwindigkeit rückwärts
ru: Задняя скорость

source: The speed at which motor runs in reverse direction when the DX3 board contact is connected to ground.
de: Die Geschwindigkeit mit der der Motor rückwärts läuft, wenn der "DX3" Kontakt auf dem Board mit Masse (GND) verbunden ist.
ru: Максимальная скорость вращения в процентах от максимальной в режиме заднего хода (включаемого подключением точки DX3 на плате к земле).

source: Overcurrent detection delay
de: Überstromerkennungsverzögerung
ru: Задержка отсечки по току

source: The amount of time before the phase current limit takes effect Rising this parameter will help you start quicker from a dead stop, but don't set this too high as you risk blowing out your motor - at high currents it will quickly heat up. Set it to 0 to disable overcurrent.
de: Die Verzögerung, mit der die Phasenstrombegrenzung aktiv wird. Ein erhöhen des Wertes erleichtert das schnelle Losfahren aus dem Stillstand. Sie sollten diesen Wert jedoch nicht zu hoch ansetzen, um Schäden am Motor zu vermeiden, da sich dieser bei hohen Strömen schnell erhitzt. Setzen Sie diese Einstellung auf "0" um Überstrom zu deaktivieren.
ru: Задержка, через которую срабатывает ограничение фазного тока. Увеличьте данный параметр для более быстрого набора скорости, но не переусердствуйте, иначе рискуете спалить мотор - при больших токах он быстро нагреется. Установите в 0 для отключения данной возможности.

source: s
ru: с

source: Auto cruising time
de: Tempomat Schwelle
ru: Задержка авто-круиза

source: The amount of seconds to hold the throttle position unchanged before the 'cruising' mode will be enabled. For this to work you need to connect the CR contact on the board to ground.
de: Die Anzahl der Sekunden, die Sie den Gasgriff unverändert halten müssen, um den Tempomat-Modus zu aktivieren. Damit dies funktioniert, müssen Sie den "CR"-Kontakt auf dem Board mit Masse (GND) verbinden.
ru: Время, в течении которого необходимо удерживать ручку в одном положении, для включения режима круиза. Чтобы это работало Вам необходимо соединить контакт CR на плате с землёй.

source: Slip charge mode
de: Gasgriff Rekuperation
ru: Зарядка при сбросе скорости

source: This parameter controls regen from the throttle. If you enable it, throttling back will enable regen (and thus will brake) until the electronic braking becomes ineffective (at about 15% of full speed).
de: Dieser Parameter steuert die Rekuperation über den Gasgriff. Wenn Sie ihn aktivieren, wird die Rekuperation beim Zurückdrehen des Gasgriffes aktiv. Die Rekuperation ist so lange aktiv bis das elektrische Bremsen ineffektiv wird (bei ca. 15% der Maximalgeschwindigkeit).
ru: Если вкючить данную опцию, при сбросе газа ручкой контроллер войдёт в режим рекуперации до тех пор, пока Ваша скорость выше затребованной (ниже примерно 15% скорости регенерация в любом случае неэффективна).

source: Limit cruise
ru: Ограниченный круиз

source: So far it is unknown how this parameter affects controller function.
de: Es ist bisher nicht bekannt, wie diese Einstellung den Controller beeinflusst.
ru: На текущий момент неизвестно, как эта опция работает.

source: LED indicator mode
de: LED Modus
ru: Режим светодиодного индикатора

source: This sets the mode of the P1, P2 and P3 contacts on the board. The connected LEDs may use either a common GND or common VCC.
de: Diese Einstellung bestimmt den Modus der P1, P2 und P3 Kontakte auf dem Board. Die angeschlossenen LEDs können entweder an gemeinsamer Masse oder gemeinsamer Versorgungsspannung (VCC) betrieben werden.
ru: Этот параметр меняет режим контактов P1, P2, P3 на плате контроллера. Подсоединённые светодиоды могут быть подключены к общей земле, либо к общему питанию.

source: EBS level
de: Stärke der elektr. Bremse
ru: Уровень рекуперации

source: Electronic braking level. Choose 'Moderate' for smaller wheel diameters, and 'Strong' for 26" and up. In 'Unlimited' mode controller does not impose any limits on braking strength; this is a undocumented feature and is not guaranteed to work with your controller. The larger is the level, the more effective is braking.
de: Stärke der elektrischen Bremse. Wählen Sie "Moderat" für kleinere Felgendurchmesser und "Stark" für 26" und größer. Bei der Einstellung "Unbegrenzt" bestehen seitens des Controllers keine Begrenzungen bei der maximalen Bremsbetätigung. Dies ist jedoch eine undokumentierte Einstellung und könnte mit Ihrem Controller nicht funktionieren. Je höher Sie das Level setzen, umso effektiver ist das elektrische Bremsen.
ru: Мощность рекуперации (и, соответственно, сила электронного торможения). Выберите 'Средний' уровень для колёс с малым диаметром и 'Высокий' уровень для колёс диаметром 26 дюйма и выше. В режиме 'Неограниченный' контроллер никак не ограничивает ток рекуперации; эта опция недокументирована и может не работать на Вашем контроллере.

source: EBS limit voltage
de: Max. Rückspeisespannung
ru: Макс. напряжение рекуперации

source: When regen is enabled (also known as electronic braking system) the controller effectively acts as a step-up DC-DC converter, transferring energy from the motor into the battery. This sets the upper voltage limit for this DC-DC converter, which is needed to prevent blowing out the controller MOSFETs.
de: Wenn die Rekuperation (auch bekannt als elektronisches Bremssystem) aktiv ist, arbeitet der Controller quasi als Step-Up-Wandler, der Energie vom Motor in den Akku transferiert. Diese Einstellung bestimmt die maximale Spannung dieses DC-DC-Wandlers, um die Controller MOSFETs vor Überlastung zu bewahren.
ru: В режиме рекуперации контроллер, по сути, работает в режиме повышающего импульсного преобразователя напряжения. Данный параметр позволяет задать максимальное выходное напряжение этого преобразователя. Удостоверьтесь, что это напряжение не превышает возможности выходных КМОП ключей контроллера.

source: Guard signal polarity
de: Polarität des Wächtersignals
ru: Уровень сигнала блокировки

source: The polarity of the Guard signal, which should be connected to the TB pin on the board When Guard is active, controller will prevent rotating the wheel in any direction. This is useful if used together with a motorcycle alarm or something like that.
de: Die Polarität des Wächtersignals, welches mit dem "TB" Kontakt auf dem Board verbunden wird. Wenn der Wächtermodus aktiv ist, verhindert der Controller jegliches Drehen des Rades. Dieser Modus ist nützlich in Verbindung mit Motorradalarmanlagen oder Ähnlichem.
ru: Для включении режима блокировки следует подключить точку TB на плате к земле(в режиме 'Низкий') или к питанию (в режиме 'Высокий'). В этом режиме контроллер активно препятствует изменению позиции колеса (активно тормозит).

source: Throttle blowout protect
de: Gassignal Defekterkennung
ru: Защита от неисправности ручки газа

source: Enable this parameter to let the controller check if your throttle output is sane (e.g. if the Hall sensor in the throttle is not blown out). If it is broken, you might get a constant full-throttle condition, which might be not very pleasant.
de: Wenn Sie diese Einstellung aktivieren, so prüft der Controller ob sich Ihr Gassignal in vernünftigen Bereichen bewegt (z.B.ob der Hallensor im Gasgriff defekt). Bei Defekten kann sonst eine äußerst unangenehme Dauervollgas-Situation eintreten.
ru: Включите данную опцию, чтобы защититься от случайно сгоревшего датчика Холла в ручке газа. В случае перегорания выходного транзистора датчика контроллер может вдруг дать полный газ, что неприятно.

source: PAS mode
de: PAS Modus
ru: Режим помощи педалям

source: Pedal Assisted Sensor mode.
de: Modus des Pedelec Sensors
ru: Режим работы датчика вращения педалей.

source: PAS start pulse
de: PAS Startimpulse
ru: Стартовый импульс датчика

source: The amount of pulses from the PAS sensor to skip before starting assisting to pedalling.
de: Die Anzahl der Impulse vom Pedelec Sensor, nach denen der Controller anfängt, Motorunterstützung zuzusteuern.
ru: Количество пропускаемых импульсов от датчика вращения педалей до включения режима поддержки.

source: PAS max speed
de: PAS Maximalgeschwindigkeit
ru: Максимальная скорость поддержки

source: This sets the speed limit when using the pedal assistant.
de: Die Einstellung bestimmt die Geschwindigkeitsbegrenzung bei Benutzung des Pedelec Sensors.
ru: Ограничение скорости при работе с датчиком вращения педалей.

source: Default speed
de: Standardgeschwindigkeit
ru: Скорость по умолчанию

source: This determines which of the four programmed speed limits will be default after power on.
de: Diese Einstellung bestimmt, welche Geschwindigkeit beim Einschalten voreingestellt sein wird.
ru: Эта опция задаёт скорость, которая устанавливается при включении.

source: Hall sensors angle
de: Winkel der Hallsensoren
ru: Угол между датчиками Холла

source: The (electric) angle between Hall sensors in your motor. Most motors use sensors at 120 degrees, but sometimes this may differ. Choose "Auto" if you want the controller to detect this automatically.
de: Der (elektrische) Winkel zwischen den Hallsensoren in Ihrem Motor. Die meisten Motoren verwenden Sensoren mit einem Winkel von 120 Grad, dies kann jedoch abweichen. Wählen Sie "Automatisch" wenn der Controller diese Einstellung automatisch erkennen soll.
ru: Электрический угол между датчиками Холла в двигателе. В большинстве двигателей датчики установлены через 120 градусов, но иногда могут встретиться и другие. Выберите режим "Авто" для автоматического определения угла.

source: Hardware type
de: Hardware
ru: Тип контроллера

source: Current/Voltage design
de: Ströme/Spannungen
ru: Токи и напряжения

source: Speed modes
de: Geschwindigkeitsmodi
ru: Скоростной режим

source: Regeneration
de: Bremsenergierückgewinnung/Rekuperation
ru: Настройки рекуперации

source: Pedal Assist Sensor
de: Pedelec Sensor
ru: Датчик вращения педалей

source: External devices
de: Peripherie
ru: Внешние устройства

source: Waiting for controller ready
de: Warte auf Controller...
ru: Ожидание готовности контроллера

source: Waiting acknowledgement
de: Warte auf Bestätigung...
ru: Ожидание подтверждения

source: Controller says received data is broken
de: Der Controller meldet, dass die übertragenen Daten fehlerhaft sind.
ru: Контроллер получил испорченные данные

source: Invalid reply byte '%(chr)02x'
de: Ungültige Antwort: '%(chr)02x'
ru: Неверный ответный байт '%(chr)02x'

source: Infineon 3
ru: Инфинеон 3

source: Cycle
de: Sequenziell
ru: Цикл

source: Long (~3s)
de: Lang (~3s)
ru: Долго (~3с)

source: Short (~1s)
de: Kurz (~1s)
ru: Кратко (~1с)

source: Cruise
de: Cruise-Modus
ru: Круиз

source: Cruise & Failure code
de: Cruise-Modus & Fehlercodes
ru: Круиз & Код ошибки
