Repository: bigbr1212/xpd-ebike
Catalog: po/*.po
Languages: de, ru

source: The way how the speed switch functions. When in 'Switch' mode you may use a three-position switch which connects X1 (speed 1) or X2 (speed 3) to GND, or leaves both unconnected (speed 2). In 'Cycle' mode connecting X1 to ground with a momentary switch will toggle between speeds 1, 2 and 3 (speed 1 is default after power-on).
de: Die Art auf welche der Geschwindigkeitsschalter funktioniert. Im Modus "Schalter" können Sie einen drei-Wege-Schalter verwenden, der X1 (Geschwindigkeit 1) oder X2 (Geschwindigkeit 3) mit Masse (GND) verbindet, oder auch beide unverbunden lässt (Geschwindigkeit 2). Im Modus "Sequenziell" können Sie mittels eines Tasters, der X1 mit Masse (GND) verbindet, nach der Reihe die Geschwindigkeiten von 1 bis 3 durchschalten (Geschwindigkeit 1 ist beim Einschalten aktiv).
ru: Режим работы переключателя скоростей. В режиме 'Селектор' Вы можете подключить трёхпозиционный переключатель, который соединяет точки платы X1 (скорость 1) и X2 (скорость 3) к GND для выбора одной из трёх скоростей (в случае, если оба контакта не подключены, выбирается скорость 2). В режиме 'Цикл' Вы сможете переключаться кнопкой, замыкающей контакт X1 на землю, между скоростями 1, 2 и 3 (при включении выбирается скорость 1).

source: The first speed limit.(see comment to 'speed switch mode').
de: Das erste Geschwindigkeitslimit. (Siehe auch den Kommentar zu "Geschwindigkeitsschalter")
ru: Первое ограничение скорости (см. комментарий к 'режиму переключателя').

source: The second speed limit.(see comment to 'speed switch mode').
de: Das zweite Geschwindigkeitslimit. (Siehe auch den Kommentar zu "Geschwindigkeitsschalter")
ru: Второе ограничение скорости (см. комментарий к 'режиму переключателя').

source: The third speed limit.(see comment to 'speed switch mode').
de: Das dritte Geschwindigkeitslimit. (Siehe auch den Kommentar zu "Geschwindigkeitsschalter")
ru: Третье ограничение скорости (см. комментарий к 'режиму переключателя').

source: The time motor is running after last PAS impulse.
de: Steuert die Nachlaufzeit des Motors.
ru: Длительность работы мотора после последнего импульса от датчика

source: P3 mode
de: P3 Modus
ru: Режим контакта P3

source: An additional setting for the P3 LED output. You may select between displaying only the "Cruise" mode on this LED, or both "Cruise" and fault conditions.
de: Eine zusätzliche Einstellung für die P3 LED. Sie können wählen ob nur der sog. "Cruise"-Modus auf dieser LED angezeigt wird, oder sowohl "Cruise"-Modus als auch Fehlercodes.
ru: Дополнительная настройка для точки P3 на плате. Вы можете выбрать между отображением только режима 'Круиз', или также можете вывести на данный светодиод диагностический код ошибки в случае какого-либо сбоя контроллера.

source: Infineon 2
ru: Инфинеон 2

source: FATAL: Could not find data directory
de: Achtung: Konnte Datenverzeichnis nicht finden
ru: ОШИБКА: Не могу найти каталог с данными

source: Ready
de: Bereit
ru: Готов

source: Family
de: Controllertyp
ru: Семейство

source: Model
de: Modell
ru: Модель

source: Description
de: Beschreibung
ru: Описание

source: Serial ports list updated
de: Liste der seriellen Ports wurde aktualisiert
ru: Список последовательных портов обновлён

source: Profile renamed
de: Profil umbenannt
ru: Конфигурация переименована

source: Failed to rename profile %(desc)s: %(msg)s
de: Konnte Profil nicht umbenennen: %(desc)s: %(msg)s
ru: Не удалось переименовать файл %(desc)s: %(msg)s

source: Failed to rename profile
de: Konnte Profil nicht umbenennen
ru: Не удалось переименовать конфигурацию

source: Profile saved
de: Profil gespeichert
ru: Конфигурация сохранена

source: Failed to save profile %(desc)s: %(msg)s
de: Konnte Profil nicht speichern: %(desc)s: %(msg)s
ru: Не удалось сохранить файл %(desc)s: %(msg)s

source: Failed to save profile
de: Konnte Profil nicht speichern
ru: Не удалось записать конфигурацию

source: Failed to load profile %(fn)s: %(msg)s
de: Konnte Profil nicht laden: %(fn)s: %(msg)s
ru: Ошибка загрузки конфигурации %(fn)s: %(msg)s

source: No profile selected
de: Kein Profil ausgewählt
ru: Не выбрана конфигурация

source: No serial port selected
de: Kein serieller Port ausgewählt
ru: Порт программатора не выбран

source: Uploading settings to controller
de: Übertrage Einstellungen auf den Controller
ru: Загрузка настроек в контроллер

source: Applying profile: <b>%(prof)s</b> Controller model: <b>%(ctrl)s</b> Serial port: <b>%(port)s</b> Please connect the controller to the programming cable which, in turn, must be connected to one of the computer's USB sockets. Once you're ready, press the button on the programming cable and hold it steadily for at least 10 seconds. You may release the button when this text is replaced back with a list of existing controller profiles. If the controller programs only once (that is, when you're doing it second time, the message "Waiting for controller ready" stays forever and program won't react to the cable button) you will need to completely disconnect temporarily either the controller from the cable, or the cable from the USB port.
de: Aktives Profil: %(prof)s Controller-Modell: %(ctrl)s Serieller Port: %(port)s Bitte verbinden Sie den Controller mit dem Programmierkabel, welches bereits mit einem USB-Port des Computers verbunden sein sollte. Anschließend drücken Sie den Schalter des Programmierkabels und halten ihn für mindestens 10 Sekunden gedrückt. Sie können den Schalter loslassen sobald die Übertragung abgeschlossen ist, also sobald dieser Erklärungstext wieder verschwindet.
ru: Применяется профиль: <b>%(prof)s</b> Модель контроллера: <b>%(ctrl)s</b> Последовательный порт: <b>%(port)s</b> Пожалуйста, подсоедините контроллер к шнуру программирования а тот, свою очередь, к разъёму USB компьютера. Когда будете готовы, нажмите кнопку на шнуре программирования и удерживайте его нажатым хотя бы 10 секунд. Если данный текст исчезнет и на его место вернётся список существующих профилей, можете отпустить кнопку. Если контроллер программируется только один раз (то есть, когда Вы пытаетесь сделать это во второй раз надпись "Ожидание готовности контроллера" висит вечно, программа не реагирует на нажатии кнопки на кабеле), попытайтесь временно отсоединить либо контроллер от кабеля, либо кабель от USB порта.

source: Settings uploaded successfully
de: Die Einstellungen wurde erfolgreich übertragen
ru: Параметры успешно загружены

source: Upload cancelled
de: Übertragung abgebrochen
ru: Загрузка отменена

source: Upload failed: %(msg)s
de: Übertragung fehlgeschlagen: %(msg)s
ru: Неудачная загрузка: %(msg)s

source: New profile
de: Neues Profil
ru: Новая конфигурация

source: New
de: Neu
ru: Новый

source: Are you sure you want to delete profile "%s"?
de: Wollen Sie wirklich das Profil "%s" löschen?
ru: Уверены, что хотите удалить конфигурацию "%s"?

source: Profile deleted
de: Profil gelöscht
ru: Конфигурация удалена

source: Failed to remove profile file %(fn)s
de: Konnte Profildatei %(fn)s nicht löschen
ru: Не удалось удалить файл конфигурации %(fn)s

source: Failed to delete profile
de: Konnte Profil nicht löschen
ru: Не удалось удалить конфигурацию

source: Ooops! Something bad happened, and I can't handle it! Please report the following information to author: %(msg)s
de: Hopperla! Da ist was schief gelaufen und ich kann damit nicht umgehen! Bitte senden Sie die folgenden Informationen dem Author des Programmes: %(msg)s
ru: Опаньки! Случилось непредвиденное, и я не знаю как с этим дальше жить! Пожалуйста, передайте мою предсмертную записку автору: %(msg)s

source: 164 Mode P1-DAT P2-CLK
de: 164 Modus P1-DAT P2-CLK
